#pragma once

namespace celeritas
{
    enum class time_refresh_type
    {
        null,

        // 每日重置：根据服务器的每日刷新锚点（如05:00:00）进行判断和重置。
        // 参数：相对于每日零点的毫秒时间。
        daily,

        // 每周重置：根据服务器的每周刷新锚点（如每周一05:00:00）进行重置。
        // 参数：相对于每周一零点的毫秒时间。
        weekly,

        // 每月重置：根据服务器的每月刷新锚点（如每月1号05:00:00）进行重置。
        // 参数：相对于每月1号零点的毫秒时间。
        monthly,

        // 相对时间间隔刷新 (基于上一次触发时间)
        // 间隔时间重置：基于上一次触发时间，经过固定时长（例如3小时）后重置。常用于 buff 计时、体力恢复倒计时等。
        // 参数：间隔时间（毫秒）。
        interval_duration,

        // 一次性/绝对时间点刷新
        // 绝对时间点重置：在特定的绝对时间点（例如 2026年1月1日 00:00）触发一次，随后失效。常用于活动结束、赛季结束等。
        // 参数：刷新的毫秒时间戳。
        absolute_point,
    };
}